#include <iostream>
using namespace std;
int main()
{
    // تو این خط متغیر های n,i,m,flag ایجاد و مقدار m , flag برابر 0 قرار گرفته میشه
    int n, i, m = 0, flag = 0;

    cout << "Enter the Number to check Prime :";

    //تو این خط یه عدد به عنوان ورودی از کاربر گرفته میشه و داخل n ذخیره میشه
    //این عدد ورودی در ادامه برسی خواهد شد که عدد اول است یا خیر
    cin >> n;
    //اینجا مقدار m رو برابر نصف مقدار ورودی کاربر قرار میدیم
    // دلیل اینکار این هست که یک عدد نهایتا تا نصف مقدار خودش میتونه مقسوم علیه داشته باشه نه بیشتر
    m = n / 2;
    cout << m << endl;
    //اینجا وارد یه حلقه ای میشیم که به ازای هر عدد از مقدار 2 تا m که نصف عدد ورودی کاربر هست برسی میکنیم که باقی ماندش چقدر هست
    // اگر باقی مانده هر یک از این اعداد برابر صفر بود یعنی عدد ورودی به ان عدد بخش پذیر است و عدد مورد نظر اول نیست
    for (i = 2; i <= m; i++)
    {
        //این همون شرطیه که برسی میکنیم اگر باقی مانده n بر i که شمارنده ماست برابر صفر باشه مقدار flag رو 1 و از حلقه خارج میشیم
        if (n % i == 0)
        {
            //اینجا میگیم عدد اوئل نیست
            cout << "Number is not Prime." << endl;
            //مقدار فلگ رو برابر 1 قرار میدیم تا بعدا ازش استفاده بشه
            flag = 1;
            //دستور خروج از حلقه
            break;
        }
    }
    //اینجا نسبت به مقدار فلگ برسی میکنیم اگر فلگمون برابر سفر بود پس یعنی هیچ وقت داخل حلقه نتونسته وارد شرطمون بشه و یعنی باقی مانده عددمون به هیچ کدوم از این اعداد برابر صفر نبود پس عدد اول هست
    if (flag == 0)
    {
        //به مخاطب میگیم عدد اول هست
        cout << "Number is Prime." << endl;
    }
    //مقدار صفر رو برمیگردونیم تا تابع بسته بشه
    return 0;
}
