#include <iostream>
using namespace std;

int main()
{
    // اینجا متغییر های n r sum , temp ایجاد و مقدار sum برابر صفر قرار گرفته میشه
    int n, r, sum = 0, temp;
    cout << "Enter the Number=";
    // اینجا یک عدد ورودی از کاربر میگیریم و میریزیم داخل متغیر n
    cin >> n;
    // اینجا مقدار ورودی کاربر رو دوباره داخل متغییر temp میریزیم تا تا وقتی متغییر n عوض شد مقدار اولیه رو داشته باشیم 
    temp = n;
    //اینجا وارد یه حله میشین و تا زمانی که n بزرگتر از 0 باشه به این حلفه ادامه میدیم
    // هدف از این حله پیدا کردن مقلوب عدد ورودی است تا بتونیم مقایسش کنیم با اصل عدد و اگه اینا برابر بودن بگیم عدد پالیندروم است
    while (n > 0)
    {
        // اینجا باقی مانده n رو بر ده (که میشه مقدار یکانش)
        // می ریزیم داخل r
        r = n % 10;
        // اینجا مقدار sum رو برابر 10 برابر مقدار خودش بعلاوه مثدار r  که باقی مانده n بر 10 بود قرار میدیم
        //اینکار باعث میشه که یک عدد از اول برداشته و به اخر sum اضافه کنیم
        sum = (sum * 10) + r;
        //اینجا هم مقدار n رو بر 10 تقسیم میکنیم تا یکانش رو که به انتهای sum اضافه کردیم و کارمون باهاش تموم شده حذف بشه
        n = n / 10;
    }
    //اینجا برسی میکنیم اگه مقدار temp 
    //که مقدارش برابر عدد ورودی اولیه هست با sun که مقلوب اون هست برابر باشه میگیم عدد پالیندروم هست وگرنه خیر
    if (temp == sum)
    {
        cout << "Number is Palindrome.";
    }
    else
    {
        cout << "Number is not Palindrome.";
    }
    //اینجا مقدار 0 رو برمیگردونیم تا تابع بسته بشه
    return 0;
}